// See https://aka.ms/new-console-template for more information



/* Შექმენით კლასი Employee რომელსაც ექნება სახელი, გვარი, პირადი ნომერი და ხელფასის ველები. 
  Შექმენით კლასი დეპარტამენტი რომელსაც ექნება დეპარტამენტის დასახელება და  მაქსიმალური თანამშრომელის რაოდენობა (ველები). 
  Employee კლასში დაამატეთ დეპარტამენტი ისე რომ შეიძებოდეს ამ დეპარტამენტებში თანამშრომლების დამატება , 
  იმ შემთხვევაში თუ მაქსიმალურ რაოდენობას გადააჭარბა თანამშრომელი ვერ უნდა დაემატოს. Შექმენით მეთოდები რომელიც : 
 

Დაბეჭდავს თანამშრომლების სიას დეპარტამენტების მიხედვით
Დაითვლის თანამშრომლების რაოდენობას თითოეულ დეპარტამენტში (ცალკე ველი არ უნდა გქონდეს დეპარტამენტის კლასში ამისთვის)
*/






using EmployeeInDeps;




Employee